app/controllers/ilance_projects_controller.rb

SELECT `ilance_projects`.* FROM `ilance_projects`
---
  def index
    @ilance_projects = IlanceProject.all

INSERT INTO "ilance_projects" DEFAULT VALUES RETURNING "id"
---
  def create
    @ilance_project = IlanceProject.new(ilance_project_params)

    respond_to do |format|
      if @ilance_project.save

DELETE FROM "ilance_projects" WHERE "ilance_projects"."id" = $1  [["id", 48]]
---
  def destroy
    @ilance_project.destroy

SELECT  "ilance_projects".* FROM "ilance_projects"  WHERE "ilance_projects"."id" = $1 LIMIT 1  [["id", 48]]
---
    def set_ilance_project
      @ilance_project = IlanceProject.find(params[:id])