app/controllers/ilance_users_controller.rb

INSERT INTO "ilance_users" ("password", "salt", "username") VALUES ($1, $2, $3) RETURNING "user_id"  [["password", "$2a$10$FwTZavC6bxq5pdftfRY3COzOGK/RhLbu7kKBEgLm7u0FfTXkNLBda"], ["salt", "$2a$10$FwTZavC6bxq5pdftfRY3CO"], ["username", "polo"]]
---
	def create
		@user = IlanceUser.new(user_params)
		if @user.save